app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"
---
  def index
      @pins = current_user.pins.all

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
      @pin = current_user.pins.find(params[:id])